Autodesk.Navisworks.Api.DocumentParts.DocumentHyperlinks
Stores the Hyperlinks information contained in a Document.

Autodesk.Navisworks.Api.DocumentParts.DocumentHyperlinks.Changed
Occurs when the document hyperlinks have changed.

Autodesk.Navisworks.Api.DocumentParts.DocumentHyperlinks.Changing
Occurs when the document hyperlinks are about to change.

Autodesk.Navisworks.Api.DocumentParts.DocumentHyperlinks.DeleteHyperlinks(Autodesk.Navisworks.Api.ModelItem)
Deletes all hyperlinks from a ModelItem.

Autodesk.Navisworks.Api.DocumentParts.DocumentHyperlinks.GetHyperlinks(Autodesk.Navisworks.Api.ModelItem)
Gets hyperlinks for a ModelItem.

Autodesk.Navisworks.Api.DocumentParts.DocumentHyperlinks.ResetAllHyperlinks
Resets hyperlinks on all ModelItems.

Autodesk.Navisworks.Api.DocumentParts.DocumentHyperlinks.ResetHyperlinks(Autodesk.Navisworks.Api.ModelItem)
Resets hyperlinks on a ModelItem back to their original state.

Autodesk.Navisworks.Api.DocumentParts.DocumentHyperlinks.SetHyperlinks(Autodesk.Navisworks.Api.ModelItem,Autodesk.Navisworks.Api.HyperlinkCollection)
Sets hyperlinks for a ModelItem from a list of hyperlinks.